read_verilog  Design_Sources/showstudentID.v
hierarchy -top showstudentID
proc; opt; fsm; opt; memory; opt; #techmap; opt;
write_verilog showstudentID_synth.v